log = [
    {
        "date": "2021/07/24",
        "items": [
            "界面： 新增符號調轉數字調（臺羅）服務",
        ]
    },
    {
        "date": "2020/03/17",
        "items": [
            "界面： 新增兩個播放按鍵，前一則與後一則",
        ]
    },
    {
        "date": "2020/02/15",
        "items": [
            "界面： 列表畫面",
            "熱鍵： alt+play(P), alt+update(U)",
        ]
    },
    {
        "date": "2020/02/08",
        "items": [
            "界面： 編輯畫面（劇名，集數，原始華語，過濾名稱）",
            "增加欄位： 原始華語，原始台語",
            "播放器： 修正不精準結尾時間（ex: 399297 399683）",
            "下載： 提供直接下載text (uid, trans)",
            "熱鍵： 自動鎖定當前滑鼠所hover的處理單位 play(P), update(U)",
            "批量更新"
        ]
    },
    {
        "date": "2020/01/30",
        "items": [
            "界面： 中文化",
            "增加欄位： review",
            "過濾： 格式修改與預設為未檢查",
            "更新： 更新後自動將checked設為true，checked也改為唯讀"
        ]
    },
    {
        "date": "2020/01/24",
        "items": [
            "界面： 登入與台語劇選擇畫面",
            "統計資訊： 整齣戲劇統計與個別集數統計資訊",
            "資料庫： 新增表格（播放清單）與為字幕表格增加數個欄位（已檢查、已捨棄、音檔時間切斷、更改者）",
            "搜尋： 可\"檢查\"與\"捨棄\"來過濾字幕"
        ]
    }
]
